# Pandas

Example DataFrame assumed by cheat sheet commands below:

In [3]:
import pandas as pd
df = pd.DataFrame.from_dict(dict(a=[1,11,111],
                                 b=[2,22,222],
                                 c=[3,33,333],
                                 aa=[1,11,111],
                                 bb=[2,22,222],
                                 cc=[3,33,333]),
                                 orient='index',  # the keyword labeled items are rows
                                 columns=['A',"B","C"]  # need to label the columns independently
                           )
df

    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

### Selecting DataFrame rows and columns

Pandas provides two parallel ways of indexing data, called **Native Pandas** and **Numpy-like** in the table below.

Native Pandas indexing largely works as if the DataFrame is a dictionary of dictionaries: The outer keys are
the column names and the inner keys are the row handles (or index elements).

Numpy-like indexing always uses `.loc` and always  follows the `numpy` pattern for
indexing 2D data; the accessor is in the form `.loc[row,col]`. 

The third way of indexing data is by positional indexing: Retrieve the $i$th item regardless
of index handle.  This can always be done via `.iloc`. Pandas also provides a shortcut
for positional slicing of rows, shown below:

Summary:

| Selection | Native Pandas  |  Numpy-like     |
| :-- | :- | :- |
|  row      | NA | df.loc['c'] |
| row slice |  NA           |df.loc['c': 'bb'] |
|  col | df['A'] | df.loc[:,'A'] |
| row, col | df['A']['c'] | df.loc['c', 'A'] |
|          |               | df.loc['c']['A'] |
| bool series | df['A'] == 2 | df.loc[:,"A"] == 2 |
| bool selection | df[df['A'] == 2] | df.loc[df['A'] == 2] |
| row (position) |   NA             | df.iloc[2]  |
| col (position)      |   NA             | df.iloc[:,2] |
| row slice (position)    |                  | df[:5] |
| col slice (position)    |                  | df.iloc[:,:2] |
| fancy indexing (cols)    |  df[['A', 'C']]   | df.loc[:,['A', 'C']] 
| fancy indexing (rows)    |  NA   | df.loc[['b', 'bb']] 
| first rows      |  df.head(n)  | NA
| last rows       |  df.tail(n)  | NA

The above commands with results:

In [2]:
print("\nDataFrame")
print(df)
print("\nrow selection numpylike df.loc['c'] pd.Series")
print(df.loc['c'])
print("\nrow slice numpylike df.loc['c': 'bb'] pd.DataFrame")
print(df.loc['c': 'bb'])
print("\nrow col native pandas df['A']['c'] Data Type(int)")
print(df['A']['c'])
print("\nrow col numpylike df.loc['c','A'] Data Type(int)")
print(df.loc['c']['A'])
print("\nbool series native pandas df['A'] == 2 Pd.Series (Boolean)")
print(df['A'] == 2)
print("\nbool series numpylike df.loc[:,'A'] == 2 Pd.Series (Boolean)")
print(df.loc[:,"A"] == 2)
print("\nbool selection native pandas df[df['A'] == 2] pd.DataFrame")
print(df[df['A'] == 2])
print("\nbool selection numpy like df.loc[df.loc[:,'A'] == 2] pd.DataFrame")
print(df.loc[df.loc[:,'A'] == 2])
print("\nrow (position) df.iloc[2] pd.Series")
print(df.iloc[2] )
print("\ncol (position) df.iloc[:,2] pd.Series")
print(df.iloc[:,2])
print("\nrow slice position df[2:5] ")
print(df[2:5])
print("\ncolumn slice position df.iloc[:,:2] ")
print(df.iloc[:,:2])
print("\nfancy indexing cols native pandas df[['A','C']] pd.DataFrame")
print(df[['A','C']])
print("\nfancy indexing cols numpylike df.loc[:,['A','C']] pd.DataFrame")
print(df.loc[:,['A','C']])
print("\nfancy indexing rows df.loc[['b','bb']] pd.DataFrame")
print(df.loc[['b','bb']])
print("\nfirst 5 rows of df df.head(5)")
print(df.head(5) )
print("\nlast 5 rows of df df.tail(5)")
print(df.tail(5))

DataFrame
    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

row selection numpylike df.loc['c'] pd.Series
A      3
B     33
C    333
Name: c, dtype: int64

row slice numpylike df.loc['c': 'bb'] pd.DataFrame
    A   B    C
c   3  33  333
aa  1  11  111
bb  2  22  222

row col native pandas df['A']['c'] Data Type(int)
3

row col numpylike df.loc['c','A'] Data Type(int)
3

bool series native pandas df['A'] == 2 Pd.Series (Boolean)
a     False
b      True
c     False
aa    False
bb     True
cc    False
Name: A, dtype: bool

bool series numpylike df.loc[:,'A'] == 2 Pd.Series (Boolean)
a     False
b      True
c     False
aa    False
bb     True
cc    False
Name: A, dtype: bool

bool selection native pandas df[df['A'] == 2] pd.DataFrame
    A   B    C
b   2  22  222
bb  2  22  222

bool selection numpy like df.loc[df.loc[:,'A'] == 2] pd.DataFrame
    A   B    C
b   2  22  222
bb  2  22  222

row (position) df.iloc[2] pd.Series
A      3
B     33
C    333
Name: c, dtype: int64

col (position) df.iloc[:,2] pd.Series
a     111
b     222
c     333
aa    111
bb    222
cc    333
Name: C, dtype: int64

row slice position df[2:5]
    A   B    C
c   3  33  333
aa  1  11  111
bb  2  22  222

column slice position df.iloc[:,:2]
    A   B
a   1  11
b   2  22
c   3  33
aa  1  11
bb  2  22
cc  3  33

fancy indexing cols native pandas df[['A','C']] pd.DataFrame
    A    C
a   1  111
b   2  222
c   3  333
aa  1  111
bb  2  222
cc  3  333

fancy indexing cols numpylike df.loc[:,['A','C']] pd.DataFrame
    A    C
a   1  111
b   2  222
c   3  333
aa  1  111
bb  2  222
cc  3  333

fancy indexing rows df.loc[['b','bb']] pd.DataFrame
    A   B    C
b   2  22  222
bb  2  22  222

first 5 rows of df df.head(5)
    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222

last 5 rows of df df.tail(5)
    A   B    C
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

### Pandas delete data

Begin with `df`:

In [195]:
df

    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

Delete some rows from `df`:

In [193]:
df.drop(["b","aa","cc"])

   A   B    C
a  1  11  111
b  2  22  222
c  3  33  333

Or just drop rows for one column:

In [196]:
df["B"].drop(["b","aa","cc"])

a     11
c     33
bb    22
Name: B, dtype: int64

Or drop entire columns:

In [198]:
df.drop(columns=["B"])

    A    C
a   1  111
b   2  222
c   3  333
aa  1  111
bb  2  222
cc  3  333

### Pandas missing data cleanup

Create a DataFrame with some missing values by executing elementwise arithmetic with 
a DF that has only a partial index match.

In [199]:
df_with_missing = df + df.loc["a":"c"]
df_with_missing

      A     B      C
a   2.0  22.0  222.0
aa  NaN   NaN    NaN
b   4.0  44.0  444.0
bb  NaN   NaN    NaN
c   6.0  66.0  666.0
cc  NaN   NaN    NaN

Drop all rows with undefined values from the DataFrame

In [8]:
df_with_missing.dropna()

     A     B      C
a  2.0  22.0  222.0
b  4.0  44.0  444.0
c  6.0  66.0  666.0

Or just do one column:

In [14]:
df_with_missing["B"].dropna()

a    22.0
b    44.0
c    66.0
Name: B, dtype: float64

Fill undefined values with carefully thought about filler (0 is not always the right choice).

In [22]:
df_with_missing.fillna(0)

      A     B      C
a   2.0  22.0  222.0
aa  0.0   0.0    0.0
b   4.0  44.0  444.0
bb  0.0   0.0    0.0
c   6.0  66.0  666.0
cc  0.0   0.0    0.0

### (Re)Indexing

Basic accessor function:

In [38]:
print(df)
print(df.index)

    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333
Index(['a', 'b', 'c', 'aa', 'bb', 'cc'], dtype='object')

Note that the object returned is of a new type, a `pandas Index`.

Reindex to new index discarding and adding rows as needed:

Specifically: Drop all rows in `df` that are not in `new_index`. Add all
elements of `new_index` not already in `df` and fill the new rows with `NaN`.

In [47]:
print("df:\n",df)
print()
new_index=["a","aa","c", "bb","xx"]
print("new_index:\n ", new_index)
print("\ndf.reindex(new_index):\n",df.reindex(new_index))

df:
     A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

new_index:
  ['a', 'aa', 'c', 'bb', 'xx']

df.reindex(new_index):
       A     B      C
a   1.0  11.0  111.0
aa  1.0  11.0  111.0
c   3.0  33.0  333.0
bb  2.0  22.0  222.0
xx  NaN   NaN    NaN

Same reindexing operation, but use the index of another DataFrame

In [4]:
df2 = pd.DataFrame.from_dict(dict(x=[4,444,44],
                                 y=[5,55,555],
                                 z=[6,666,66],
                                 a=[7,77,777],
                                 b=[8,888,88],
                                 c=[9,99,999]),
                                 orient='index',  # the keyword labeled items are rows
                                 columns=['A',"B","C"]  # need to label the columns independently
                           )
print("df:\n",df)
print()
print("df2:\n",df2  )

df:
     A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

df2:
    A    B    C
x  4  444   44
y  5   55  555
z  6  666   66
a  7   77  777
b  8  888   88
c  9   99  999

Reindex df with index of df2.

In [60]:
df.reindex_like(df2)

     A     B      C
x  NaN   NaN    NaN
y  NaN   NaN    NaN
z  NaN   NaN    NaN
a  1.0  11.0  111.0
b  2.0  22.0  222.0
c  3.0  33.0  333.0

Set one of the columns to be an index.

In [5]:
df.set_index("B")

    A    C
B
11  1  111
22  2  222
33  3  333
11  1  111
22  2  222
33  3  333

### Columnwise (re)indexing

Another way of think of a Pandas DataFrame is as a 2D array that is indexed 
in two dimensions.  One dimension is the one we have been
calling the index dimension all along.  The other is the column
dimension.  That too can be thought of as an index.

To access that "index" do:

In [61]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

Note that the type of the object returned is a `pandas Index`.

To reindex in that dimension use `df.reindex(columns=[...])".

In [62]:
df.reindex(columns=["B","C","A","X"])

     B    C  A   X
a   11  111  1 NaN
b   22  222  2 NaN
c   33  333  3 NaN
aa  11  111  1 NaN
bb  22  222  2 NaN
cc  33  333  3 NaN

### Sorting

Sort the index:

In [64]:
print(df2)
print()
print(df2.sort_index())

   A    B    C
x  4  444   44
y  5   55  555
z  6  666   66
a  7   77  777
b  8  888   88
c  9   99  999

   A    B    C
a  7   77  777
b  8  888   88
c  9   99  999
x  4  444   44
y  5   55  555
z  6  666   66

Sort the rows in the DataFrame by the values in one column:

In [65]:
print(df2)
print()
print(df2.sort_values(by="B"))

   A    B    C
x  4  444   44
y  5   55  555
z  6  666   66
a  7   77  777
b  8  888   88
c  9   99  999

   A    B    C
y  5   55  555
a  7   77  777
c  9   99  999
x  4  444   44
z  6  666   66
b  8  888   88

### Transpose DataFrame

Transpose DataFrame

In [205]:
df.T

     a    b    c   aa   bb   cc
A    1    2    3    1    2    3
B   11   22   33   11   22   33
C  111  222  333  111  222  333

### Pandas I/O

Output:

```python
df.to_csv("foo.csv")
to_excel("foo.xlsx", sheet_name)
```

Input:

```python
read_csv("foo.csv")
read_excel("foo.xlsx","sheet1", index_col = None, na_values = ["NA"])
```

### Pandas Time Series

Create a datetime index with 184 days

```python
pd.date_range("1992-01-03", "1992-07-04", freq="D")
```

The `freq` parameter options include:

```python
"B" Business Day 
"D" Calender day 
"W" Weekly
"M" Monthly
"Q" Quarterly
"A" Annual
"H" Hourly
```

In [44]:
import pandas as pd
import numpy as np

Let's suppose the data in `df` is datable, and let's add the date information to `df`

In [24]:
dti2 = pd.date_range("1992-02-01", "1992-02-06",freq="D")
df["Date"] = dti2
df

    A   B    C       Date
a   1  11  111 1992-02-01
b   2  22  222 1992-02-02
c   3  33  333 1992-02-03
aa  1  11  111 1992-02-04
bb  2  22  222 1992-02-05
cc  3  33  333 1992-02-06

We now have what is called Time Series data.

We can query various temporal properties like day of the week:

In [37]:
df[df["Date"].dt.day_name() == "Wednesday"]

    A   B    C       Date
bb  2  22  222 1992-02-05

To better see how this works, and to demonstrate some of the richness afforded
by temporal structure, let's cook up some data that gives us more to work with:

In [26]:
dti = pd.date_range("1992-01-03", "1992-07-04",freq="D")
print(len(dti))
dti

184

DatetimeIndex(['1992-01-03', '1992-01-04', '1992-01-05', '1992-01-06',
               '1992-01-07', '1992-01-08', '1992-01-09', '1992-01-10',
               '1992-01-11', '1992-01-12',
               ...
               '1992-06-25', '1992-06-26', '1992-06-27', '1992-06-28',
               '1992-06-29', '1992-06-30', '1992-07-01', '1992-07-02',
               '1992-07-03', '1992-07-04'],
              dtype='datetime64[ns]', length=184, freq='D')

The sequence returned by `date_range` is a  `DatetimeIndex` instance.

The sequence is indexable and objects in the `DatetimeIndex` are `pandas` `Timestamp` indices.

In [27]:
ts0 = dti[0]
ts0

Timestamp('1992-01-03 00:00:00', freq='D')

which have various attributes and methods:

In [38]:
(ts0.year,ts0.month,ts0.month_name(),ts0.day,ts0.day_name(),ts0.hour,ts0.minute,ts0.second)

(1992, 1, 'January', 3, 'Friday', 0, 0, 0)

The index provides vectorized access to these attributes:

The `DatetimeIndex` can  be converted into a Series (which is implicitly what we did when we made `dti2`
a column of `df`):

In [40]:
dts = pd.Series(dti)
dts

0     1992-01-03
1     1992-01-04
2     1992-01-05
3     1992-01-06
4     1992-01-07
         ...
179   1992-06-30
180   1992-07-01
181   1992-07-02
182   1992-07-03
183   1992-07-04
Length: 184, dtype: datetime64[ns]

As a Series, vectorized access to the temporal attributes is available only through the `.dt` (so `.dt`
works on a datetime Series much like `.str` works on columns of data type `str`).

In [41]:
dts.dt.day_name()

0         Friday
1       Saturday
2         Sunday
3         Monday
4        Tuesday
         ...
179      Tuesday
180    Wednesday
181     Thursday
182       Friday
183     Saturday
Length: 184, dtype: object

This is why we needed to use `.dt` when we acessed the `"Date"` column in `df` above.

Create some data for which our `TimeIndex` `dti`  is a suitable index
and wrap it all in a `DataFrame`.

In [45]:
time_data = pd.DataFrame(np.random.randn(len(dti),2),index=dti,columns=["A","B"])
time_data

                   A         B
1992-01-03 -0.193739 -0.528823
1992-01-04  0.462737  0.555263
1992-01-05 -0.564091  0.639840
1992-01-06  1.822215  0.499665
1992-01-07 -0.882803 -1.350034
...              ...       ...
1992-06-30  1.682460  0.324128
1992-07-01 -1.202654 -0.391517
1992-07-02  0.415325  0.178731
1992-07-03  0.126647  1.134403
1992-07-04 -0.977053 -1.259775

[184 rows x 2 columns]

Note that this time the temporal data has been used as the index, so `.dt` is unncessary.

In [30]:
time_data.loc[time_data.index.month==7]

                   A         B
1992-07-01  1.102884  3.085568
1992-07-02 -1.218488  1.078562
1992-07-03  0.703275 -0.017331
1992-07-04 -1.367606  1.688156

As a convenience, datetime strings can also be used

In [45]:
time_data.loc['1992-07-01']

A    1.102884
B    3.085568
Name: 1992-07-01 00:00:00, dtype: float64

In [31]:
time_data.loc['1992-07']

                   A         B
1992-07-01  1.102884  3.085568
1992-07-02 -1.218488  1.078562
1992-07-03  0.703275 -0.017331
1992-07-04 -1.367606  1.688156

### Resample time data

Resample the data in a new DataFrame indexed by weeks instead of days; this requires choosing an
operation (`.mean()`) to aggregate the values for the 7 days of each week:

In [46]:
time_data_r = time_data.resample("W")["A","B"].mean()
print(len(time_data_r))
time_data_r[-7:]

27

                   A         B
1992-05-24  0.073463  0.254713
1992-05-31  0.299242  0.339419
1992-06-07  0.182525 -0.049025
1992-06-14  0.614016  0.511351
1992-06-21  0.015241 -0.406397
1992-06-28 -0.253471  0.166774
1992-07-05  0.269418 -0.175477

The weeks in the new index are named after the last day in each week.

Note that temporally resampling the data follows a familiar script: 

1. The rows of the daily data are grouped into
calender weeks of data; 
2. The mean of each group is taken for a particular column; and 
3. The results are assembled into a `DataFrame`.  

This is the split/apply/combine strategy all over again. The result of the resampling step is an
object which indexes groups of rows very much as the `GroupBy` objects we looked in `bda_pandras_intro`
did:

In [190]:
time_data.resample("W")

This is explored more fully in the `bda_pandas_intro_part_2` notebook, using stocks data.

### Multi-index Commands

Taken from the Pandas multi-index tutorial.

In [46]:
arrays = [
    np.array(["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"]),   #Outer level (level=0)
    np.array(["one", "two", "one", "two", "one", "two", "one", "two"]),   #Inner level (level=1)
]

df3 = pd.DataFrame(np.random.randn(8, 4), index=arrays,columns=["A","B","C","D"])
df3

                A         B         C         D
bar one -0.340123 -0.140130  0.338231 -0.922284
    two -0.671930 -1.079205  2.123702 -1.411511
baz one -0.586698  0.151475  1.223816 -0.003500
    two -0.251808 -0.987930  0.145054  1.447666
foo one  0.763745 -0.231831  1.096466  1.175345
    two  0.424787 -0.433366  0.391762  0.205134
qux one -3.067451 -1.350756  0.438804  1.850020
    two -0.678922  1.158885 -0.577477 -0.250459

Convert inner index into columns, resulting in multilevel columns

From pandas tutorial: "Change innermost row index into lowest level of column labels."

In [210]:
df4 = df3.unstack()
df4

            A                   B                   C                   D  \
          one       two       one       two       one       two       one
bar  0.199489 -2.340291  0.925925  0.345419 -1.250594 -0.649030 -0.715851
baz  0.333647 -0.343160  0.337047 -1.295761 -0.835772 -1.362783 -0.299229
foo -1.092304  3.217491  0.090385 -2.257533  1.545141 -0.151800 -0.222063
qux  0.417225 -0.160177  1.696412 -1.300267 -0.264894  0.389970 -1.226665


          two
bar  0.863499
baz  2.079374
foo -1.965173
qux -0.822512

From pandas tutorial: "[.stack()] change[s] lowest level of column labels into innermost row index." 

In this case that reverses what we just did:

In [211]:
df4.stack()

                A         B         C         D
bar one  0.199489  0.925925 -1.250594 -0.715851
    two -2.340291  0.345419 -0.649030  0.863499
baz one  0.333647  0.337047 -0.835772 -0.299229
    two -0.343160 -1.295761 -1.362783  2.079374
foo one -1.092304  0.090385  1.545141 -0.222063
    two  3.217491 -2.257533 -0.151800 -1.965173
qux one  0.417225  1.696412 -0.264894 -1.226665
    two -0.160177 -1.300267  0.389970 -0.822512

Note that when there is only one level of columns, `.stack()`  will use that to add one level
to the index, producing a `Series`:

In [12]:
print(df,end="\n\n")
print(type(df.stack()))
print(df.stack())

    A   B    C
a   1  11  111
b   2  22  222
c   3  33  333
aa  1  11  111
bb  2  22  222
cc  3  33  333

<class 'pandas.core.series.Series'>
a   A      1
    B     11
    C    111
b   A      2
    B     22
    C    222
c   A      3
    B     33
    C    333
aa  A      1
    B     11
    C    111
bb  A      2
    B     22
    C    222
cc  A      3
    B     33
    C    333
dtype: int64